# FocusGained Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockableFrameFocusChangedEventArgs..::..FocusGained Property
DockableFrameFocusChangedEventArgs Class See Also
---
True if the pane is being activated, false if it is being inactivated.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool FocusGained { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FocusGained As Boolean
	Get
```

Visual C++
---
```text
public:
property bool FocusGained {
	bool get ();
}
```

# See Also
DockableFrameFocusChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace